In [1]:
import pandas as pd
import numpy as np

In [2]:
pessoas_Df = pd.read_csv("dataset\DATASET.CSV",delimiter=';')

In [3]:
df_tmp = pessoas_Df
df_tmp

            Primeiro Nome           Sobrenomes Peso (kg) Altura (m)
0                  felipe        neves da hora      70,6       1,69
1                sandro                barbosa      90,5       1,73
2                  maycon    da silva ferreira    100,01       1,82
3             jeferson                Oliveira     80,04       1,75
4                  manuel       gomes   vieira     63,05        1,8
..                    ...                  ...       ...        ...
94                   Luna           Lunara Lua        70       1,86
95                  hulk                  jose      35,5        1,2
96                  maria                gomes     58,05       1,56
97                  paulo                rocha     98,07          2
98  Luane                   Santana   Teixeira     50,78        1,5

[99 rows x 4 columns]

In [4]:
df_tmp['Peso (kg)'] = df_tmp['Peso (kg)'].str.replace(',', '.').astype(float)
df_tmp['Altura (m)'] = df_tmp['Altura (m)'].str.replace(',', '.').astype(float)

In [5]:
df_tmp.head()

  Primeiro Nome         Sobrenomes  Peso (kg)  Altura (m)
0        felipe      neves da hora      70.60        1.69
1      sandro              barbosa      90.50        1.73
2        maycon  da silva ferreira     100.01        1.82
3   jeferson              Oliveira      80.04        1.75
4        manuel     gomes   vieira      63.05        1.80

In [6]:
def calcular_imc(df):
    df['Peso (kg)'] = df['Peso (kg)'].fillna(0)
    df['Altura (m)'] = df['Altura (m)'].fillna(0)
    # Iterar pelas linhas do DataFrame
    for i, row in df.iterrows():
        if row['Peso (kg)'] == 0 or row['Altura (m)'] == 0:
            df.at[i, 'IMC'] = None
        else:
            df.at[i, 'IMC'] = round(row['Peso (kg)'] / (row['Altura (m)'] ** 2), 2)
    return df

In [7]:
def mostrar_dados(df):
    # Selecionar e retornar as colunas desejadas
    return df[['Primeiro Nome', 'Sobrenomes', 'IMC']]

In [11]:
calcular_imc(df_tmp)
df_tmp

            Primeiro Nome           Sobrenomes  Peso (kg)  Altura (m)    IMC
0                  felipe        neves da hora      70.60        1.69  24.72
1                sandro                barbosa      90.50        1.73  30.24
2                  maycon    da silva ferreira     100.01        1.82  30.19
3             jeferson                Oliveira      80.04        1.75  26.14
4                  manuel       gomes   vieira      63.05        1.80  19.46
..                    ...                  ...        ...         ...    ...
94                   Luna           Lunara Lua      70.00        1.86  20.23
95                  hulk                  jose      35.50        1.20  24.65
96                  maria                gomes      58.05        1.56  23.85
97                  paulo                rocha      98.07        2.00  24.52
98  Luane                   Santana   Teixeira      50.78        1.50  22.57

[99 rows x 5 columns]

In [13]:
df_tmp.isnull()

    Primeiro Nome  Sobrenomes  Peso (kg)  Altura (m)    IMC
0           False       False      False       False  False
1           False       False      False       False  False
2           False       False      False       False  False
3           False       False      False       False  False
4           False       False      False       False  False
..            ...         ...        ...         ...    ...
94          False       False      False       False  False
95          False       False      False       False  False
96          False       False      False       False  False
97          False       False      False       False  False
98          False       False      False       False  False

[99 rows x 5 columns]

In [9]:
df_resultado = mostrar_dados(df_tmp)

In [10]:
df_resultado.isnull().to_csv('resultado_imc.txt', sep='\t', index=False)